IdeaRS.Connections
AggregatedPropWrpAttribute Class
Compatible with IDEA StatiCa 0.0
 Represents the attribute which describes the type of the interface, the wrapper and the parameter of the aggregated property format of the string is 'the name of the interface, the name of the wrapper, the name of the parameter'
Inheritance Hierarchy
Object
 Attribute
 IdeaRS.Connections.Data.AggregatedPropWrpAttribute
 Namespace: IdeaRS.Connections.Data
 Assembly: IdeaRS.Connections (in IdeaRS.Connections.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public class AggregatedPropWrpAttribute : Attribute
The AggregatedPropWrpAttribute type exposes the following members.
Constructors
Name | Description
AggregatedPropWrpAttribute
 Constructor
Top
Properties
Name | Description
PropertyType
 Gets or sets the string which represents the aggregated property : 'the name of the interface, the name of the wrapper, the name of the parameter'
TypeId
When implemented in a derived class, gets a unique identifier for this Attribute.
 (Inherited from Attribute.)
Top
Methods
Name | Description
Equals
Returns a value that indicates whether this instance is equal to a specified object.
 (Inherited from Attribute.)
Finalize
Allows an object to try to free resources and perform other cleanup operations before it is reclaimed by garbage collection.
 (Inherited from Object.)
GetHashCode
Returns the hash code for this instance.
 (Inherited from Attribute.)
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
IsDefaultAttribute
When overridden in a derived class, indicates whether the value of this instance is the default value for the derived class.
 (Inherited from Attribute.)
Match
When overridden in a derived class, returns a value that indicates whether this instance equals a specified object.
 (Inherited from Attribute.)
MemberwiseClone
Creates a shallow copy of the current Object.
 (Inherited from Object.)
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
Top
See Also
Reference
IdeaRS.Connections.Data Namespace